Ran Plan for dir: `infrastructure/gcp/k8s-deployment/helm-argocd` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.google_project.current: Reading...
data.google_client_config.current: Reading...
data.google_client_config.current: Read complete after 0s [id=projects/"onlineshop-378118"/regions/"asia-southeast2"/zones/<null>]
data.google_project.current: Read complete after 1s [id=projects/onlineshop-378118]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.helm.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ols-argo-cd"
      + namespace                  = "cd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = []
      + verify                     = false
      + version                    = "5.43.4"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "ingress.annotations.networking\\.gke\\.io/managed-certificates"
          + value = "argo-cd-cert"
        }
      + set {
          + name  = "server.GKEmanagedCertificate.domains[0]"
          + value = "argocd.ols.blast.co.id"
        }
      + set {
          + name  = "server.GKEmanagedCertificate.enabled"
          + value = "true"
        }
      + set {
          + name  = "server.ingress.annotations.external-dns\\.alpha\\.kubernetes\\.io/hostname"
          + value = "argocd.ols.blast.co.id"
        }
      + set {
          + name  = "server.ingress.annotations.kubernetes\\.io/ingress\\.class"
          + value = "gce"
        }
      + set {
          + name  = "server.ingress.enabled"
          + value = "true"
        }
      + set {
          + name  = "server.ingress.hosts[0]"
          + value = "argocd.ols.blast.co.id"
        }
    }

  # module.helm.kubernetes_manifest.manifest[0] will be created
+ resource "kubernetes_manifest" "manifest" {
      + manifest = {
          + apiVersion = "networking.gke.io/v1"
          + kind       = "ManagedCertificate"
          + metadata   = {
              + name      = "argo-cd-cert"
              + namespace = "cd"
            }
          + spec       = {
              + domains = [
                  + "argo-cd.ols.blast.co.id",
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.gke.io/v1"
          + kind       = "ManagedCertificate"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argo-cd-cert"
              + namespace                  = "cd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + domains = [
                  + "argo-cd.ols.blast.co.id",
                ]
            }
        }
    }

  # module.helm.kubernetes_namespace.namespace[0] will be created
+ resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "cd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/gcp/k8s-deployment/helm-argocd`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-gce-atlantis:4141/lock?id=greyhats13%252Fol_shop%252Finfrastructure%252Fgcp%252Fk8s-deployment%252Fhelm-argocd%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/gcp/k8s-deployment/helm-argocd`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`